In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter
print(os.listdir("../input"))

['imbd-sf']

In [7]:
import pandas as pd
data = pd.read_csv('data.csv')
data.head(5)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015
3,tt2488496,11.173104,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,5292,7.5,2015
4,tt2820852,9.335014,190000000,1506249360,Furious 7,Vin Diesel|Paul Walker|Jason Statham|Michelle ...,James Wan,Vengeance Hits Home,Deckard Shaw seeks revenge against Dominic Tor...,137,Action|Crime|Thriller,Universal Pictures|Original Film|Media Rights ...,4/1/2015,2947,7.3,2015

In [8]:
len(data)

1890

# Предобработка датасета

In [11]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [12]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
Film_table = data[['original_title','budget']]
Film_table.sort_values(by=['budget'], ascending=False).head(5)

                                   original_title     budget
491                             The Warrior's Way  425000000
724   Pirates of the Caribbean: On Stranger Tides  380000000
1670     Pirates of the Caribbean: At World's End  300000000
14                        Avengers: Age of Ultron  280000000
1015                                  John Carter  260000000

In [13]:
answer_ls.append(4)

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [14]:
Film_table = data[['original_title','runtime']]
Film_table.sort_values(by=['runtime'], ascending=False).head(5)

                                     original_title  runtime
1158                              Gods and Generals      214
1082  The Lord of the Rings: The Return of the King      201
1737                                     Grindhouse      191
1337                                      King Kong      187
505                                    Pearl Harbor      183

In [15]:
answer_ls.append(2)

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [16]:
Film_table = data[['original_title','runtime']]
Film_table.sort_values(by=['runtime'], ascending=True).head(5)

            original_title  runtime
769        Winnie the Pooh       63
931   Return to Never Land       72
1098     The Jungle Book 2       72
1627     Home on the Range       76
1409               Valiant       76

In [17]:
answer_ls.append(3)

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [18]:
data['runtime'].mean()

109.65343915343915

In [19]:
answer_ls.append(2)

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [20]:
data['runtime'].median()

106.5

In [21]:
answer_ls.append(1)

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [22]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
data[['profit', 'original_title', 'imdb_id']].sort_values('profit', ascending=False).head(5)

         profit                original_title    imdb_id
239  2544505847                        Avatar  tt0499549
3    1868178225  Star Wars: The Force Awakens  tt2488496
0    1363528810                Jurassic World  tt0369610
4    1316249360                     Furious 7  tt2820852
971  1299557910                  The Avengers  tt0848228

In [23]:
answer_ls.append(5)

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [24]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
data[['profit', 'original_title', 'imdb_id']].sort_values('profit', ascending=True).head(5)

         profit                original_title    imdb_id
491  -413912431             The Warrior's Way  tt1032751
1246 -165710090               The Lone Ranger  tt1210819
1617 -119180039                     The Alamo  tt0318974
810  -111007242               Mars Needs Moms  tt1305591
959   -92896027  The Adventures of Pluto Nash  tt0180052

In [25]:
answer_ls.append(2)

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [26]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
Film_table = data[['profit', 'original_title', 'imdb_id']].sort_values('profit', ascending=True)
k=0
for i in Film_table['profit']:
    if int(i)>=0:
        k+=1
print(k)

1478

In [27]:
answer_ls.append(1)

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [28]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('release_year == 2008')
df[['profit', 'original_title', 'imdb_id']].sort_values('profit', ascending=False).head(5)

        profit                                     original_title    imdb_id
600  816921825                                    The Dark Knight  tt0468569
604  601636033  Indiana Jones and the Kingdom of the Crystal S...  tt0367882
608  557841637                                         Mamma Mia!  tt0795421
607  501744560                                      Kung Fu Panda  tt0441773
622  474029371                                            Hancock  tt0448157

In [29]:
answer_ls.append(4)

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [30]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('release_year >= 2012 and release_year <= 2014')
df[['profit', 'original_title', 'imdb_id']].sort_values('profit', ascending=True).head(5)

         profit                   original_title    imdb_id
1246 -165710090                  The Lone Ranger  tt1210819
1215  -68351500                         R.I.P.D.  tt0790736
1008  -51893525                      Upside Down  tt1374992
1303  -51337973  Legends of Oz: Dorothy's Return  tt0884726
1236  -45510171               Bullet to the Head  tt1308729

In [31]:
answer_ls.append(5)

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [32]:
pd.DataFrame(data.genres.str.split('|').tolist()).stack().value_counts()

Drama              782
Comedy             683
Thriller           597
Action             583
Adventure          416
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            223
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             20
Documentary          8
Foreign              2
dtype: int64

In [33]:
answer_ls.append(3)

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [34]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('profit > 0')
pd.DataFrame(df.genres.str.split('|').tolist()).stack().value_counts()

Drama              560
Comedy             551
Thriller           446
Action             444
Adventure          337
Romance            242
Crime              231
Family             226
Science Fiction    195
Fantasy            188
Horror             150
Animation          120
Mystery            119
Music               47
History             46
War                 41
Western             12
Documentary          7
dtype: int64

In [35]:
answer_ls.append(1)

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [36]:
pd.DataFrame(data.director.tolist()).stack().value_counts()

Steven Soderbergh    13
Ridley Scott         12
Clint Eastwood       12
Steven Spielberg     10
Shawn Levy           10
                     ..
Liev Schreiber        1
Nick Hamm             1
Steve Bendelack       1
Todd Graff            1
Don McKellar          1
Length: 958, dtype: int64

In [37]:
answer_ls.append(3)

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [38]:
pd.DataFrame(df.director.tolist()).stack().value_counts()

Ridley Scott         12
Steven Soderbergh    10
Steven Spielberg     10
Clint Eastwood       10
Shawn Levy            9
                     ..
J.B. Rogers           1
Stuart Baird          1
Asger Leth            1
Don Mancini           1
Jean-Marc VallÃ©e     1
Length: 774, dtype: int64

In [39]:
answer_ls.append(4)

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [40]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
data.groupby('director')['profit'].agg(['sum']).sort_values(by='sum', ascending=False).head(10)

                          sum
director
Peter Jackson      5202593685
David Yates        3379295625
Christopher Nolan  3162548502
J.J. Abrams        2839169916
Michael Bay        2760938960
James Cameron      2548546718
Francis Lawrence   2476979588
Steven Spielberg   2449700791
Joss Whedon        2424593677
Gore Verbinski     2271362290

In [41]:
answer_ls.append(5)

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [42]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
actors = pd.DataFrame(data.cast.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'Actors' : actors})
profits = []
for actor in result_dataframe['Actors'].to_list():
    profits.append(data[data.cast.str.contains(actor)]['profit'].sum())
result_dataframe['Profit'] = profits
display(result_dataframe.sort_values(by='Profit', ascending=False).head(1))

             Actors      Profit
1561 2  Emma Watson  6666245597

In [43]:
answer_ls.append(1)

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [44]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('release_year == 2012')
actors = pd.DataFrame(df.cast.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'Actors' : actors})
profits = []
for actor in result_dataframe['Actors'].to_list():
    profits.append(df[df.cast.str.contains(actor)]['profit'].sum())
result_dataframe['Profit'] = profits
display(result_dataframe.sort_values(by='Profit', ascending=True).head(1))

             Actors    Profit
37 0  Kirsten Dunst -68109207

In [45]:
answer_ls.append(3)

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [46]:
data = pd.read_csv('data.csv')
data['avg_budg'] = data['budget'].mean()
df = data.query('budget > avg_budg')
actors = pd.DataFrame(df.cast.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'Actors' : actors})
films_count = []
for actor in result_dataframe['Actors'].to_list():
    films_count.append(df[df.cast.str.contains(actor)]['original_title'].count())
result_dataframe['films_count'] = films_count
display(result_dataframe.sort_values(by='films_count', ascending=False).head(1))

          Actors  films_count
78 0  Matt Damon           18

In [47]:
answer_ls.append(4)

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [48]:
data = pd.read_csv('data.csv')
df = data.query('cast.str.contains("Nicolas Cage")',  engine='python')
genres = pd.DataFrame(df.genres.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'genres' : genres})
genres_count = []
for genres in result_dataframe['genres'].to_list():
    genres_count.append(df[df.genres.str.contains(genres)]['genres'].count())
result_dataframe['genres_count'] = genres_count
display(result_dataframe.sort_values(by='genres_count', ascending=False).head(1))

     genres  genres_count
8 0  Action            17

In [49]:
answer_ls.append(2)

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [50]:
data = pd.read_csv('data.csv')
studio = pd.DataFrame(data.production_companies.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'studio' : studio})
film_count = []
for studio in result_dataframe['studio'].to_list():
    film_count.append(data[data.production_companies.str.contains(studio)]['original_title'].count())
result_dataframe['film_count'] = film_count
display(result_dataframe.sort_values(by='film_count', ascending=False).head(1))

C:\Users\Boris\anaconda3\lib\site-packages\pandas\core\strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

           studio  film_count
1210 2  Universal         185

In [51]:
answer_ls.append(1)

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [52]:
data = pd.read_csv('data.csv')
df = data.query('release_year == 2015')
studio = pd.DataFrame(df.production_companies.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'studio' : studio})
film_count = []
for studio in result_dataframe['studio'].to_list():
    film_count.append(df[df.production_companies.str.contains(studio)]['original_title'].count())
result_dataframe['film_count'] = film_count
display(result_dataframe.sort_values(by='film_count', ascending=False).head(1))

C:\Users\Boris\anaconda3\lib\site-packages\pandas\core\strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

            studio  film_count
60 1  Warner Bros.          12

In [53]:
answer_ls.append(4)

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [54]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('genres.str.contains("Comedy")',  engine='python')
studio = pd.DataFrame(df.production_companies.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'studio' : studio})
studio_profit = []
for studio in result_dataframe['studio'].to_list():
    studio_profit.append(df[df.production_companies.str.contains(studio)]['profit'].sum())
result_dataframe['studio_profit'] = studio_profit
display(result_dataframe.sort_values(by='studio_profit', ascending=False).head(1))

C:\Users\Boris\anaconda3\lib\site-packages\pandas\core\strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

          studio  studio_profit
465 0  Universal     9130349034

In [55]:
answer_ls.append(2)

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [56]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('release_year == 2012')
studio = pd.DataFrame(df.production_companies.str.split('|').tolist()).stack()
result_dataframe = pd.DataFrame({'studio' : studio})
studio_profit = []
for studio in result_dataframe['studio'].to_list():
    studio_profit.append(df[df.production_companies.str.contains(studio)]['profit'].sum())
result_dataframe['studio_profit'] = studio_profit
display(result_dataframe.sort_values(by='studio_profit', ascending=False).head(1))

C:\Users\Boris\anaconda3\lib\site-packages\pandas\core\strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

                 studio  studio_profit
64 0  Columbia Pictures     2501406608

In [57]:
answer_ls.append(3)

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [58]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('production_companies.str.contains("Paramount Pictures")',  engine='python')
df[['profit', 'original_title']].sort_values('profit', ascending=True).head(1)

       profit        original_title
926 -64831034  K-19: The Widowmaker

In [59]:
answer_ls.append(1)

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [60]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
data.groupby('release_year')['profit'].agg(['sum']).sort_values(by='sum', ascending=False).head(10)

                      sum
release_year
2015          18668572378
2014          16397812953
2012          16077001687
2013          15243179791
2011          14730241341
2009          13423744372
2010          13117292530
2008          11663881990
2007          11565911801
2004           9634180720

In [61]:
answer_ls.append(5)

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [62]:
data = pd.read_csv('data.csv')
data['profit'] = data['revenue'] - data['budget']
df = data.query('production_companies.str.contains("Warner Bros")',  engine='python')
df.groupby('release_year')['profit'].agg(['sum']).sort_values(by='sum', ascending=False).head(10)

                     sum
release_year
2014          2295464519
2007          2201675217
2008          2134595031
2010          1974712985
2011          1871393682
2003          1855493377
2009          1822454136
2013          1636453400
2004          1631933725
2005          1551980298

In [63]:
answer_ls.append(1)

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [64]:
data = pd.read_csv('data.csv')
data['month'] = [release_date.split('/')[0] for release_date in data.release_date]
data.groupby('month')['original_title'].agg(['count']).sort_values(by='count', ascending=False).head(12)

       count
month
9        227
12       191
10       186
8        161
3        156
4        149
6        147
11       146
7        142
5        140
2        135
1        110

In [65]:
answer_ls.append(4)

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [66]:
data = pd.read_csv('data.csv')
data['month'] = [release_date.split('/')[0] for release_date in data.release_date]
df = data.query('month == "6" or month == "7" or month == "8"')
df['original_title'].count()

450

In [67]:
answer_ls.append(2)

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [68]:
data = pd.read_csv('data.csv')
data['month'] = [release_date.split('/')[0] for release_date in data.release_date]
df = data.query('month == "1" or month == "2" or month == "12"')
data.groupby('director')['original_title'].agg(['count']).sort_values(by='count', ascending=False).head(1)

                   count
director
Steven Soderbergh     13

In [69]:
answer_ls.append(1)

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [70]:
data = pd.read_csv('data.csv')
data['profit'] = data.revenue-data.budget
df=data
df['release_date'] = pd.to_datetime(df['release_date'])
df['release_date'] = df['release_date'].dt.strftime('%B')
d = df.groupby(['release_year','release_date'])['profit'].sum()
d_df = d.reset_index()
h= d_df.groupby(['release_year'])['profit'].max()
h_df = h.reset_index()
joined = h_df.merge(d_df, on='profit', how='left')
a=joined['release_date'].value_counts().index[0]
display(a)

'June'

In [71]:
answer_ls.append(2)

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [72]:
def counter(movie_bd, x):
    data_plot=movie_bd[x].str.cat(sep='|')
    dat=pd.Series(data_plot.split('|'))
    info=dat.value_counts(ascending=False)
    return info
data['title_length'] = data['original_title'].map(lambda x: len(x))
sum_gen = counter(data,'production_companies')
for gen in sum_gen.index:
    sum_gen[gen] = data['title_length'][data['production_companies'].map(lambda x: True if gen in x else False)].mean()
sum_gen = pd.DataFrame(sum_gen).sort_values(0, ascending=False)
display(sum_gen)

                             0
Four By Two Productions     83
Jim Henson Company, The     59
Dos Corazones               47
Museum Canada Productions   46
Polsky Films                46
...                         ..
Everest Entertainment        3
Berlanti Productions         3
Global Entertainment Group   2
XM2 Productions              2
Ixtlan Productions           2

[1772 rows x 1 columns]

In [73]:
answer_ls.append(5)

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [79]:
answer_ls.append(5)

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [80]:
import pandas as pd
data = pd.read_csv('data.csv')
words = set()
for i in data['original_title'].to_list():
    for j in i.lower().split():
        words.add(j)
print(len(words))

2461

In [81]:
answer_ls.append(3)

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [82]:
n = int(len(data)*0.01)
display(data.sort_values(by='vote_average', ascending=False).head(n)['original_title'])

600                                       The Dark Knight
125                                    The Imitation Game
9                                              Inside Out
118                                          Interstellar
34                                                   Room
1082        The Lord of the Rings: The Return of the King
873                                           The Pianist
1801                                              Memento
1192                                     12 Years a Slave
128                                             Gone Girl
138                              The Grand Budapest Hotel
119                               Guardians of the Galaxy
1184                              The Wolf of Wall Street
370                                             Inception
316                                              3 Idiots
1564                Eternal Sunshine of the Spotless Mind
497     The Lord of the Rings: The Fellowship of the Ring
28                                              Spotlight
Name: original_title, dtype: object

In [83]:
answer_ls.append(1)

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [84]:
import itertools
import collections
actors=collections.Counter()
for i, j in data.iterrows():
    k = j.cast.split('|')
    actors.update([ x for x in itertools.combinations(k,2)])
actors.most_common(5)

[(('Daniel Radcliffe', 'Rupert Grint'), 8),
 (('Daniel Radcliffe', 'Emma Watson'), 8),
 (('Rupert Grint', 'Emma Watson'), 7),
 (('Ben Stiller', 'Owen Wilson'), 6),
 (('Johnny Depp', 'Helena Bonham Carter'), 6)]

In [85]:
answer_ls.append(5)

# 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [86]:
answer_ls.append(4)

# Submission

In [87]:
len(answer_ls)

36

In [88]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       2
7    8       1
8    9       4
9   10       5
10  11       3
11  12       1
12  13       3
13  14       4
14  15       5
15  16       1
16  17       3
17  18       4
18  19       2
19  20       1
20  21       4
21  22       2
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       1
29  30       2
30  31       5
31  32       5
32  33       3
33  34       1
34  35       5
35  36       4